app/views/videos/_comment.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`comment_id` = 1
---
      <div class="collapsible-header" style="height:10%;">
      	<%= image_tag User.find(comment.commentor_id).profile_picture ,class: "circle" %>