app/views/videos/_form.html.erb

SELECT  `tags`.* FROM `tags` WHERE `tags`.`name` = '' LIMIT 1
---
  });
  $('.chips').on('chip.add', function(e, chip){
    var b = document.getElementById("tag_name").value
    b = b +","+ chip["tag"];
    document.getElementById("tag_name").value = b;
    });