app/views/videos/edit.html.erb

SELECT `tags`.* FROM `tags`
---
  });
  $('.chips').on('chip.add', function(e, chip){
    var b = document.getElementById("tag_name").value
    b = b +","+ chip["tag"];
    document.getElementById("tag_name").value = b;
  });