app/views/videos/new.html.erb

  });
  $('.chips').on('chip.add', function(e, chip){
    var b = document.getElementById("tag_name").value
    b = b +","+ chip["tag"];
    document.getElementById("tag_name").value = b;
    });
---
SELECT  `tags`.* FROM `tags` WHERE `tags`.`name` = 'Sarthak' LIMIT 1