app/views/videos/show.html.erb

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 1 LIMIT 1
---
  function viewed(){
    <% c = Video.find(params[:id])