app/controllers/comments_controller.rb

  def create
  	@comment = @video.comments.new(comment_params)
    @comment.commentor = current_user
    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`commentor_id`, `body`, `comments_id`, `video_id`, `created_at`, `updated_at`) VALUES (12, 'Trying', 1, 50, '2017-11-09 15:15:33', '2017-11-09 15:15:33')

  def set_article
    @video = Video.find(params[:id])
---
SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 50 LIMIT 1