app/controllers/videos_controller.rb

SELECT `videos`.* FROM `videos` WHERE `videos`.`published` = 1
---
  def index
    @videos = Video.where(published: true)

SELECT `comments`.* FROM `comments` WHERE `comments`.`video_id` = 50 AND `comments`.`comments_id` IS NULL
---
  def show
    @comments = Video.find(params[:id]).comments.where(comments_id: nil)

SELECT `tags`.* FROM `tags`
---
  def new
    @tags = Tag.all

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 2 LIMIT 1
SELECT `tags`.* FROM `tags`
---
  def edit
    @id = params[:id]
    @video = Video.find(@id)
    @stag = @video.tags
    br = Array.new
    for i in @stag
      br.push("#{i.name}")
    end
    @savedTag = br
    @tags = Tag.all

SELECT  `tags`.* FROM `tags` WHERE `tags`.`name` = 'kuch ' LIMIT 1
INSERT INTO `tags` (`name`, `occurence`, `created_at`, `updated_at`) VALUES ('kuch ', 0, '2017-10-18 16:00:24', '2017-10-18 16:00:24')
INSERT INTO `tags_videos` (`video_id`, `tag_id`) VALUES (6, 1)
INSERT INTO `videos` (`title`, `description`, `uploader_id`, `published`, `created_at`, `updated_at`, `preview_images`, `movie`, `tag_name`) VALUES ('Kannuu My Love', 'Final Hit', 12, 1, '2017-10-23 06:41:16', '2017-10-23 06:41:16', '[\"Modelling_Part3.png\"]', 'Scrat_In_Love.mp4', ',Sample,Sample2,U,R,My,Everything')
UPDATE `tags` SET `occurence` = 2, `updated_at` = '2017-10-23 06:41:15' WHERE `tags`.`id` = 22
---
  def create
    video_params["tag_name"][0]=""
    ar = video_params["tag_name"].split(",")
    ar.delete("")
    for i in ar
      i.capitalize!
    end
    @video = Video.new(video_params)
    @video.uploader = current_user
    @video.count = 0
    for i in ar
      @s = Tag.find_by_name(i)
      if(@s.nil? == true)
        @newTag = Tag.new(:name => i ,:occurence => 1)
        @newTag.save
        @video.tags << @newTag
      else
        count = @s.occurence
        @s.occurence = count + 1
        @s.save

SELECT  `tags`.* FROM `tags` WHERE `tags`.`name` = 'Sarthak' LIMIT 1
DELETE FROM `tags_videos` WHERE `tags_videos`.`video_id` = 50 AND `tags_videos`.`tag_id` = 39
UPDATE `tags` SET `occurence` = 7, `updated_at` = '2017-11-09 11:09:55' WHERE `tags`.`id` = 18
INSERT INTO `tags` (`name`, `occurence`, `created_at`, `updated_at`) VALUES ('\'t', 1, '2017-11-09 13:06:34', '2017-11-09 13:06:34')
INSERT INTO `tags_videos` (`video_id`, `tag_id`) VALUES (44, 18)
SELECT  1 AS one FROM `tags` INNER JOIN `tags_videos` ON `tags`.`id` = `tags_videos`.`tag_id` WHERE `tags_videos`.`video_id` = 44 AND `tags`.`id` = 18 LIMIT 1
SELECT `tags`.* FROM `tags`
---
  def update
    previous = @video.tag_name.split(",")
    current = video_params["tag_name"].split(",") - [""]
    deleted = previous - current
    newadded = current - previous
    binding.pry
    for i in deleted
      b = Tag.find_by_name(i)
      @video.tags.delete(b)
      c = b.occurence
      b.occurence = c - 1
      b.save
    end
    for i in newadded
      i.capitalize!
    end
    for i in newadded
      @s = Tag.find_by_name(i)
        if(@s.nil? == true)
          @newTag = Tag.new(:name => i ,:occurence => 1)
          @newTag.save
          @video.tags << @newTag
        else
          if(@video.tags.include? @s)

UPDATE `videos` SET `updated_at` = '2017-11-09 11:00:47', `tag_name` = ',Sarthak,Birla,Everything' WHERE `videos`.`id` = 44
---
        end
    end
    respond_to do |format|
      if @video.update(video_params)

DELETE FROM `tags_videos` WHERE `tags_videos`.`video_id` = 1
DELETE FROM `videos` WHERE `videos`.`id` = 1
---
  def destroy
    @video.destroy

SELECT `videos`.* FROM `videos` WHERE `videos`.`uploader_id` IS NULL
---
  def myvideo
    @videos = Video.where(uploader: current_user)

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 2 LIMIT 1
---
    def set_video
      @video = Video.find(params[:id])